Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSet.Remove(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Removes member element ids from the mechanical equipment set.
Remarks:
If all the members are removed, the instance of the mechanical equipment set is automatically deleted.
elemIds:
Element ids to be removed from the mechanical equipment set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted to be removed from the mechanical equipment set.
All elements should be a member of the mechanical equipment set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSet.Add(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Adds member element ids to the mechanical equipment set.
elemIds:
Element ids to be added to the mechanical equipment set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The valid members must have the same classification and system. They cannot be a member of existing set.
-or-
These elements are serially connected with each other, or with one of the set members.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSet.GetMembers
Gets member element ids for the mechanical equipment set.
Returns:
Element ids for the members in the mechanical equipment set.
Since:
2019

Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSet.AreValidMembers(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Checks if these are valid members for mechanical equipment set.
document:
The document of the member elements.
memberIds:
The member element ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSet.AreElementsNotConnectedInSeries(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Checks if the elements are not serially connected.
document:
The document of these elements.
elemIds:
The element ids to be tested.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSet.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Creates a new instance of a mechanical equipment set and adds it to the document.
document:
The document where the element will be created and added.
typeId:
The type of new mechanical equipment set.
memberIds:
The member elements of this mechanical equipment set.
Returns:
The newly created mechanical equipment set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid mechanical equipment set type.
-or-
This mechanical equipment set needs at least two members.
-or-
The valid members must have the same classification and system. A valid member cannot be a member of any other existing set.
-or-
These elements are serially connected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2019

Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSet.OnStandby
The number of pieces of mechanical equipment that are not operational at any given time.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: There should be at least one equipment on duty.
Since:
2019

Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSet.OnDuty
The number of pieces of mechanical equipment operating in parallel at any given time.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The number of on duty (number) must be less than or equal to the number of available equipments or there should be at least one equipment on duty.
Since:
2019

Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSet.Classification
The classification for the mechanical equipment set.
Since:
2019

Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSet
A set of interrelated mechanical equipment in a MEP system that works together.
Since:
2019